library IEEE;
use IEEE.STD_LOGIC_1164.ALL; -- 导入基础电路信号库，让代码能识别 '0' 和 '1' 电平

-- =====================================================================
-- 实体定义：上升沿检测芯片（edge_detect）
-- 定义芯片对外的 4 个物理管脚
-- =====================================================================
entity edge_detect is
    port (
        i_clk   : in  std_logic; -- 输入引脚：50MHz 系统主时钟（心脏脉搏，每 20ns 敲一下）
        i_rst_n : in  std_logic; -- 输入引脚：复位开关（低电平有效，'0' 代表按住复位）
        i_sig   : in  std_logic; -- 输入引脚：需要被监控的“外部野信号”
        o_rise  : out std_logic  -- 输出引脚：上升沿口哨（发现跳变时，亮起 20ns 高电平）
    );
end entity edge_detect;


-- =====================================================================
-- 内部电路结构实现
-- =====================================================================
architecture Behavioral of edge_detect is

    -- 内部寄存器（D 触发器）：专门用来保存“上一拍的旧电平”
    -- 简记：i_sig 是“现任电平”，sig_d 是“前任电平”
    signal sig_d : std_logic := '0';

begin

    --------------------------------------------------------------------
    -- 边沿检测核心进程
    -- 敏感列表 (i_clk)：代表只有在主时钟线变化时，才唤醒这个进程
    --------------------------------------------------------------------
    process(i_clk)
    begin
        -- 核心约束 1：只有在系统时钟的“上升沿（0 变 1）”瞬间，才评估和更新一次电路
        if rising_edge(i_clk) then

            ------------------------------------------------------------
            -- 情况 A：如果复位开关被按下了（i_rst_n = '0'）
            ------------------------------------------------------------
            if i_rst_n = '0' then

                sig_d  <= '0'; -- 清空内部寄存器
                o_rise <= '0'; -- 关掉输出口哨

            ------------------------------------------------------------
            -- 情况 B：系统正常工作状态
            ------------------------------------------------------------
            else

                -- 【核心逻辑 1：点火开关（算脉冲）】
                -- 当“现任是 1 (i_sig = '1')” 且 “前任是 0 (sig_d = '0')” 时：
                -- '1' and (not '0') = '1' -> o_rise 被拉高成 '1'！
                o_rise <= i_sig and (not sig_d);


                -- 【核心逻辑 2：灭火开关（打拍更新旧值）】
                -- 把这一拍的现任 i_sig 存入 sig_d。
                -- 注意：这个赋值要等到下一个时钟上升沿（20ns 后）才会真正生效！
                -- 到了下一拍，sig_d 变成了 '1'，上面的 o_rise 就会强制变成 '0'，把脉冲灭掉！
                sig_d <= i_sig;

            end if;

        end if;
    end process;

end architecture Behavioral;